---
kind: other
id: Methods.T:Autodesk.Revit.DB.CADLinkType
source: html/bdf960a7-5015-03d0-f174-4412431ebda3.htm
---
# CADLinkType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.